{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "import pandas as pd\n",
    "import numpy as np\n",
    "import glob\n",
    "import json\n",
    "import re\n",
    "import time"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "class timer:\n",
    "    def __init__(self):\n",
    "        self._start = time.time()\n",
    "        self._end = None\n",
    "        self._runtime = None\n",
    "    \n",
    "    def end(self):\n",
    "        self._end = time.time()\n",
    "        self._runtime = float(str(time.time() - self._start)[:5])\n",
    "        return self._runtime"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "def cypher_transaction(cypher):\n",
    "    uri = \"bolt://localhost:7687\"\n",
    "    driver = GraphDatabase.driver(uri, auth=(\"neo4j\", \"\"))\n",
    "    values = []\n",
    "    with driver.session() as session:\n",
    "        res = session.run(cypher)\n",
    "        for record in res:\n",
    "            values.append(record.values())\n",
    "    driver.close()\n",
    "    return values\n",
    "\n",
    "def query(cypher):\n",
    "    time = timer()\n",
    "    result = cypher_transaction(cypher)\n",
    "    runtime = time.end()\n",
    "    return result, runtime\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "def resource_metrics():\n",
    "    \n",
    "    cypher = f'''\n",
    "\n",
    "        MATCH (r:resource) \n",
    "        WITH DISTINCT(r.resourceType) AS resource_types\n",
    "            ORDER BY resource_types\n",
    "        UNWIND resource_types as resource_type\n",
    "        MATCH (r:resource)\n",
    "        WHERE r.resourceType = resource_type\n",
    "        WITH resource_type, COUNT(r) as resource_count\n",
    "        RETURN resource_type, resource_count\n",
    "            ORDER BY resource_count\n",
    "\n",
    "    '''\n",
    "\n",
    "    resource_count, runtime = query(cypher)\n",
    "    return resource_count\n",
    "    \n",
    "def database_metrics():\n",
    "    node_count = 0\n",
    "    relationship_count = 0\n",
    "    \n",
    "    cypher = f'''\n",
    "        \n",
    "        MATCH (n) \n",
    "        WITH COUNT(n) as node_count\n",
    "        MATCH ()-[r]->()\n",
    "        WITH node_count, COUNT(r) as relationship_count\n",
    "        RETURN node_count, relationship_count\n",
    "        \n",
    "    '''\n",
    "    \n",
    "    count_result, runtime = query(cypher)\n",
    "    if (len(count_result) != 0):\n",
    "        node_count = count_result[0][0]\n",
    "        relationship_count = count_result[0][1]\n",
    "    \n",
    "    return node_count, relationship_count\n",
    "    \n",
    "def wipe_database():\n",
    "    node_count, relationship_count = database_metrics()\n",
    "    \n",
    "    cypher = f'''\n",
    "\n",
    "        MATCH (n) DETACH DELETE n\n",
    "\n",
    "    '''\n",
    "\n",
    "    delete_result, runtime = query(cypher)\n",
    "    return 'Deleted {} nodes and {} relationships in {} seconds'.format( node_count, relationship_count, runtime )"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'Deleted 0 nodes and 0 relationships in 0.011 seconds'"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "wipe_database()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "--- Loaded patient \"Agustin529 Ontiveros947\" in 0.048 seconds ---\n",
      "--- Loaded patient \"Ali918 Bashirian201\" in 0.168 seconds ---\n",
      "--- Loaded patient \"Antone63 Lebsack687\" in 0.082 seconds ---\n",
      "--- Loaded patient \"Cassaundra447 Bartell116\" in 0.322 seconds ---\n",
      "--- Loaded patient \"Charise827 Durgan499\" in 0.405 seconds ---\n",
      "--- Loaded patient \"Elanor679 Williamson769\" in 0.29 seconds ---\n",
      "--- Loaded patient \"Georgianne697 Conroy74\" in 0.523 seconds ---\n",
      "--- Loaded patient \"Gracia333 Carroll471\" in 0.459 seconds ---\n",
      "--- Loaded patient \"Kum811 Purdy2\" in 1.783 seconds ---\n",
      "--- Loaded patient \"Leo278 Schaden604\" in 0.551 seconds ---\n",
      "--- Loaded patient \"Misha8 Oberbrunner298\" in 1.068 seconds ---\n",
      "--- Loaded patient \"Pauline896 Aufderhar910\" in 0.961 seconds ---\n",
      "--- Loaded patient \"Randolph418 Bernhard322\" in 1.173 seconds ---\n",
      "--- Loaded patient \"Rocky100 Erdman779\" in 0.611 seconds ---\n",
      "--- Loaded patient \"Rodrigo242 Little434\" in 0.508 seconds ---\n",
      "--- Loaded patient \"Rosendo998 Wiza601\" in 0.781 seconds ---\n",
      "--- Loaded patient \"Shon148 Roob72\" in 1.308 seconds ---\n",
      "--- Loaded patient \"Terry864 Swaniawski813\" in 0.629 seconds ---\n",
      "--- Loaded patient \"Theola421 Haag279\" in 0.298 seconds ---\n",
      "--- Loaded patient \"Tobias236 Walker122\" in 3.857 seconds ---\n",
      "--- Loaded patient \"hospitalInformation1597778337028.json\" in 0.029 seconds ---\n",
      "--- Loaded patient \"practitionerInformation1597778337028.json\" in 0.026 seconds ---\n",
      "\n",
      "In 15.88 seconds...\n",
      "Loaded 22 Patient's Medical Histories as FHIR Bundles\n",
      "Which Contained 3601 total FHIR Resources\n",
      "For a total of 70151 Nodes and 79212 Relationships in Neo4j\n",
      "At a rate of 226.763 resources per second\n",
      "Each resource has an average of 19.481 Nodes and 21.997 Relationships\n"
     ]
    }
   ],
   "source": [
    "def read_json(filename):\n",
    "    with open(filename) as json_file:\n",
    "        bundle = json.load(json_file)\n",
    "        bundle_string = json.dumps(bundle)\n",
    "        bundle_string_formatted = re.sub(r'\"', '\\\\\"', bundle_string)\n",
    "        return bundle_string_formatted\n",
    "\n",
    "def load_bundles(synthea_bundles):\n",
    "    total_time = 0.0\n",
    "    for file in range(len(synthea_bundles)):\n",
    "        bundle_string = read_json(synthea_bundles[file])\n",
    "\n",
    "        cypher = f'''\n",
    "\n",
    "            CALL cyfhir.bundle.load(\"{bundle_string}\")\n",
    "\n",
    "        '''\n",
    "        \n",
    "        patient = ' '.join(synthea_bundles[file].split('/')[2].split('_')[:2])\n",
    "        result, runtime = query(cypher)\n",
    "        print('--- Loaded patient \"{}\" in {} seconds ---'.format( patient , runtime))\n",
    "        total_time += runtime\n",
    "        \n",
    "    return round(total_time, 3)\n",
    "    \n",
    "synthea_bundles = glob.glob(\"./synthea-bundles/*.json\")\n",
    "synthea_bundles.sort()\n",
    "total_time = load_bundles(synthea_bundles)\n",
    "resource_result = np.array(resource_metrics())\n",
    "total_resources = np.sum([int(x) for x in resource_result[:,1]])\n",
    "node_count, relationship_count = database_metrics()\n",
    "\n",
    "print(\"\\nIn {} seconds...\".format(total_time))\n",
    "print(\"Loaded {} Patient's Medical Histories as FHIR Bundles\".format(len(synthea_bundles)))\n",
    "print(\"Which Contained {} total FHIR Resources\".format(total_resources))\n",
    "print(\"For a total of {} Nodes and {} Relationships in Neo4j\".format(node_count, relationship_count))\n",
    "\n",
    "print(\"At a rate of {} resources per second\".format(round(total_resources/total_time, 3)))\n",
    "print(\"Each resource has an average of {} Nodes and {} Relationships\".format(round(node_count/total_resources, 3), round(relationship_count/total_resources, 3)))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>resourceType</th>\n",
       "      <th>count</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Device</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>AllergyIntolerance</td>\n",
       "      <td>10</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>ImagingStudy</td>\n",
       "      <td>10</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Organization</td>\n",
       "      <td>11</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Practitioner</td>\n",
       "      <td>11</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Patient</td>\n",
       "      <td>20</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>CarePlan</td>\n",
       "      <td>66</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>CareTeam</td>\n",
       "      <td>66</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Immunization</td>\n",
       "      <td>100</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>DiagnosticReport</td>\n",
       "      <td>111</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>Condition</td>\n",
       "      <td>155</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>MedicationRequest</td>\n",
       "      <td>197</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>Procedure</td>\n",
       "      <td>211</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>Encounter</td>\n",
       "      <td>335</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>ExplanationOfBenefit</td>\n",
       "      <td>335</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>Claim</td>\n",
       "      <td>532</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>Observation</td>\n",
       "      <td>1428</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "            resourceType count\n",
       "0                 Device     3\n",
       "1     AllergyIntolerance    10\n",
       "2           ImagingStudy    10\n",
       "3           Organization    11\n",
       "4           Practitioner    11\n",
       "5                Patient    20\n",
       "6               CarePlan    66\n",
       "7               CareTeam    66\n",
       "8           Immunization   100\n",
       "9       DiagnosticReport   111\n",
       "10             Condition   155\n",
       "11     MedicationRequest   197\n",
       "12             Procedure   211\n",
       "13             Encounter   335\n",
       "14  ExplanationOfBenefit   335\n",
       "15                 Claim   532\n",
       "16           Observation  1428"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pd.DataFrame(resource_result, columns = [\"resourceType\", \"count\"])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Resource</th>\n",
       "      <th>References</th>\n",
       "      <th>Count</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Observation</td>\n",
       "      <td>Patient</td>\n",
       "      <td>1428</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Observation</td>\n",
       "      <td>Encounter</td>\n",
       "      <td>1428</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>ExplanationOfBenefit</td>\n",
       "      <td>Practitioner</td>\n",
       "      <td>1312</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>ExplanationOfBenefit</td>\n",
       "      <td>Patient</td>\n",
       "      <td>1005</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>DiagnosticReport</td>\n",
       "      <td>Observation</td>\n",
       "      <td>738</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Claim</td>\n",
       "      <td>Encounter</td>\n",
       "      <td>532</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Claim</td>\n",
       "      <td>Patient</td>\n",
       "      <td>532</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Claim</td>\n",
       "      <td>Organization</td>\n",
       "      <td>524</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>ExplanationOfBenefit</td>\n",
       "      <td>Encounter</td>\n",
       "      <td>335</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>ExplanationOfBenefit</td>\n",
       "      <td>Claim</td>\n",
       "      <td>335</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>Encounter</td>\n",
       "      <td>Patient</td>\n",
       "      <td>335</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>Encounter</td>\n",
       "      <td>Organization</td>\n",
       "      <td>328</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>Encounter</td>\n",
       "      <td>Practitioner</td>\n",
       "      <td>328</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>Procedure</td>\n",
       "      <td>Patient</td>\n",
       "      <td>211</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>Procedure</td>\n",
       "      <td>Encounter</td>\n",
       "      <td>211</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>Claim</td>\n",
       "      <td>Procedure</td>\n",
       "      <td>211</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>MedicationRequest</td>\n",
       "      <td>Encounter</td>\n",
       "      <td>197</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>Claim</td>\n",
       "      <td>MedicationRequest</td>\n",
       "      <td>197</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>MedicationRequest</td>\n",
       "      <td>Patient</td>\n",
       "      <td>197</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>MedicationRequest</td>\n",
       "      <td>Practitioner</td>\n",
       "      <td>196</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>Claim</td>\n",
       "      <td>Condition</td>\n",
       "      <td>155</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>ExplanationOfBenefit</td>\n",
       "      <td>Condition</td>\n",
       "      <td>155</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>Condition</td>\n",
       "      <td>Patient</td>\n",
       "      <td>155</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>Condition</td>\n",
       "      <td>Encounter</td>\n",
       "      <td>155</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>MedicationRequest</td>\n",
       "      <td>Condition</td>\n",
       "      <td>147</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>CareTeam</td>\n",
       "      <td>Patient</td>\n",
       "      <td>132</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>CareTeam</td>\n",
       "      <td>Organization</td>\n",
       "      <td>130</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>DiagnosticReport</td>\n",
       "      <td>Encounter</td>\n",
       "      <td>111</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>DiagnosticReport</td>\n",
       "      <td>Patient</td>\n",
       "      <td>111</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>Procedure</td>\n",
       "      <td>Condition</td>\n",
       "      <td>107</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>Immunization</td>\n",
       "      <td>Encounter</td>\n",
       "      <td>100</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>31</th>\n",
       "      <td>Claim</td>\n",
       "      <td>Immunization</td>\n",
       "      <td>100</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>32</th>\n",
       "      <td>Immunization</td>\n",
       "      <td>Patient</td>\n",
       "      <td>100</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>33</th>\n",
       "      <td>CarePlan</td>\n",
       "      <td>Encounter</td>\n",
       "      <td>66</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>34</th>\n",
       "      <td>CareTeam</td>\n",
       "      <td>Encounter</td>\n",
       "      <td>66</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35</th>\n",
       "      <td>CarePlan</td>\n",
       "      <td>CareTeam</td>\n",
       "      <td>66</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>36</th>\n",
       "      <td>CarePlan</td>\n",
       "      <td>Patient</td>\n",
       "      <td>66</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>37</th>\n",
       "      <td>CareTeam</td>\n",
       "      <td>Practitioner</td>\n",
       "      <td>65</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>38</th>\n",
       "      <td>CarePlan</td>\n",
       "      <td>Condition</td>\n",
       "      <td>62</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>39</th>\n",
       "      <td>AllergyIntolerance</td>\n",
       "      <td>Patient</td>\n",
       "      <td>10</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>40</th>\n",
       "      <td>ImagingStudy</td>\n",
       "      <td>Patient</td>\n",
       "      <td>10</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>41</th>\n",
       "      <td>ImagingStudy</td>\n",
       "      <td>Encounter</td>\n",
       "      <td>10</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>42</th>\n",
       "      <td>Device</td>\n",
       "      <td>Patient</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                Resource         References  Count\n",
       "0            Observation            Patient   1428\n",
       "1            Observation          Encounter   1428\n",
       "2   ExplanationOfBenefit       Practitioner   1312\n",
       "3   ExplanationOfBenefit            Patient   1005\n",
       "4       DiagnosticReport        Observation    738\n",
       "5                  Claim          Encounter    532\n",
       "6                  Claim            Patient    532\n",
       "7                  Claim       Organization    524\n",
       "8   ExplanationOfBenefit          Encounter    335\n",
       "9   ExplanationOfBenefit              Claim    335\n",
       "10             Encounter            Patient    335\n",
       "11             Encounter       Organization    328\n",
       "12             Encounter       Practitioner    328\n",
       "13             Procedure            Patient    211\n",
       "14             Procedure          Encounter    211\n",
       "15                 Claim          Procedure    211\n",
       "16     MedicationRequest          Encounter    197\n",
       "17                 Claim  MedicationRequest    197\n",
       "18     MedicationRequest            Patient    197\n",
       "19     MedicationRequest       Practitioner    196\n",
       "20                 Claim          Condition    155\n",
       "21  ExplanationOfBenefit          Condition    155\n",
       "22             Condition            Patient    155\n",
       "23             Condition          Encounter    155\n",
       "24     MedicationRequest          Condition    147\n",
       "25              CareTeam            Patient    132\n",
       "26              CareTeam       Organization    130\n",
       "27      DiagnosticReport          Encounter    111\n",
       "28      DiagnosticReport            Patient    111\n",
       "29             Procedure          Condition    107\n",
       "30          Immunization          Encounter    100\n",
       "31                 Claim       Immunization    100\n",
       "32          Immunization            Patient    100\n",
       "33              CarePlan          Encounter     66\n",
       "34              CareTeam          Encounter     66\n",
       "35              CarePlan           CareTeam     66\n",
       "36              CarePlan            Patient     66\n",
       "37              CareTeam       Practitioner     65\n",
       "38              CarePlan          Condition     62\n",
       "39    AllergyIntolerance            Patient     10\n",
       "40          ImagingStudy            Patient     10\n",
       "41          ImagingStudy          Encounter     10\n",
       "42                Device            Patient      3"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "def reference_metrics():\n",
    "    \n",
    "    cypher = f'''\n",
    "\n",
    "        MATCH (a:resource)-[*1..3]->()-[r:reference]->()-->(b:resource)\n",
    "        WITH [a.resourceType, b.resourceType] AS path\n",
    "        RETURN distinct(path) AS nodes, count(path) AS path_count\n",
    "\n",
    "    '''\n",
    "\n",
    "    reference_count, runtime = query(cypher)\n",
    "    return reference_count\n",
    "\n",
    "\n",
    "path_metrics = reference_metrics()\n",
    "as_array = [[x[0][0],x[0][1], x[1]] for x in path_metrics]\n",
    "df_references = pd.DataFrame(as_array, columns=[\"Resource\", \"References\", \"Count\"])\n",
    "df_references.sort_values([\"Count\"], inplace=True, ascending=False, ignore_index=True)\n",
    "df_references"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "True"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "def ordered(obj):\n",
    "    if isinstance(obj, dict):\n",
    "        return sorted((k, ordered(v)) for k, v in obj.items())\n",
    "    if isinstance(obj, list):\n",
    "        return sorted(ordered(x) for x in obj)\n",
    "    else:\n",
    "        return obj\n",
    "\n",
    "def get_resource(_id):\n",
    "    \n",
    "    cypher = f'''\n",
    "        WITH \"{_id}\" as _id\n",
    "        MATCH (r:resource)\n",
    "        WHERE (r.id = _id)\n",
    "        CALL cyfhir.resource.expand(r) YIELD path\n",
    "        WITH cyfhir.resource.format(collect(path)) AS resource\n",
    "        RETURN resource\n",
    "\n",
    "    '''  \n",
    "    \n",
    "    resource, runtime = query(cypher)\n",
    "    return resource\n",
    "\n",
    "\n",
    "bundle_file = \"./synthea-bundles/Theola421_Haag279_6aff2910-82fc-44d6-84a6-c29e4b756b11.json\"\n",
    "bundle = None\n",
    "with open(bundle_file) as json_file:\n",
    "        bundle = json.load(json_file)\n",
    "        \n",
    "patient_resource = bundle.get('entry')[0]['resource']\n",
    "_id = patient_resource['id']\n",
    "resource_result = get_resource(_id)[0][0]\n",
    "\n",
    "ordered(patient_resource) == ordered(resource_result)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "True"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "def get_bundle(_id):\n",
    "    \n",
    "    cypher = '''\n",
    "        WITH \"%s\" AS _id\n",
    "        CALL {\n",
    "            WITH _id\n",
    "            MATCH (a:entry)-[*1..3]->()-[r:reference]->(b:entry)\n",
    "            WHERE (b._resourceId = _id)\n",
    "            RETURN a,b\n",
    "            UNION\n",
    "            WITH _id\n",
    "            MATCH (a:entry)-[*1..3]->()-[r:reference]->(b:entry)\n",
    "            WHERE (a._resourceId = _id)\n",
    "            RETURN a,b\n",
    "        }\n",
    "        WITH collect(a)+collect(b) AS entries\n",
    "        UNWIND entries AS entry\n",
    "        CALL cyfhir.resource.expand(entry) YIELD path\n",
    "        RETURN cyfhir.bundle.format(collect(path))\n",
    "        ''' % _id\n",
    "\n",
    "    resource, runtime = query(cypher)\n",
    "    return resource\n",
    "\n",
    "bundle_file = \"./synthea-bundles/Theola421_Haag279_6aff2910-82fc-44d6-84a6-c29e4b756b11.json\"\n",
    "bundle = None\n",
    "with open(bundle_file) as json_file:\n",
    "        bundle = json.load(json_file)\n",
    "        \n",
    "_id = bundle.get('entry')[0]['resource']['id']\n",
    "bundle_result = get_bundle(_id)[0][0]\n",
    "\n",
    "ordered(bundle) == ordered(bundle_result)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
